var InitialState: any = {
    id: "Telugu",
    Left: {
        Items: [
            {
                Id: "Vowels",
                Title: "అచ్చులు",
                Count: 5,
                Show: true,
                Set:
                ["అ", "ఆ",
                    "ఇ", "ఈ",
                    "ఉ", "ఊ",
                    "ఎ", "ఏ", "ఐ",
                    "ఒ", "ఓ", "ఔ",
                    "ఋ", "ౠ"]
            },
            {
                Id: "SuperScripts",
                Title: "గుణింతాలు",
                Count: 20,
                Show: true,
                Set: ["ా",
                    "ి", "ీ",
                    "ు", "ూ",
                    "ృ", "ౄ",
                    "ె", "ే",
                    "ై",
                    "ొ", "ో",
                    "ౌ", "్",
                    "ం", "ః"]
            },
            {
                Id: "Consonants",
                Title: "హల్లులు",
                Count: 5,
                Show: true,
                Set:
                ["క", "ఖ", "గ", "ఘ", "ఙ",
                    "చ", "ఛ", "జ", "ఝ", "ఞ",
                    "ట", "ఠ", "డ", "ఢ", "ణ",
                    "త", "థ", "ద", "ధ", "న",
                    "ప", "ఫ", "బ", "భ", "మ",
                    "య", "ర", "ల", "వ",
                    "శ", "ష", "స",
                    "హ", "ళ", "ఱ",
                    "క్ష"]
            }
        ]
    },
    Center: {
        Size: 10,
        Weights: [
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,

            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        ]
    },
    Right: {}
};